MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/pio.h
/* -------- PIO_PCMR : (PIO Offset: 0x150) (R/W 32) Parallel Capture Mode Register -------- */
#define PIO_PCMR_PCEN_Pos                     _UINT32_(0)                                          /* (PIO_PCMR) Parallel Capture Mode Enable Position */
#define PIO_PCMR_PCEN_Msk                     (_UINT32_(0x1) << PIO_PCMR_PCEN_Pos)                 /* (PIO_PCMR) Parallel Capture Mode Enable Mask */
#define PIO_PCMR_PCEN(value)                  (PIO_PCMR_PCEN_Msk & (_UINT32_(value) << PIO_PCMR_PCEN_Pos)) /* Assignment of value for PCEN in the PIO_PCMR register */
#define PIO_PCMR_DSIZE_Pos                    _UINT32_(4)                                          /* (PIO_PCMR) Parallel Capture Mode Data Size Position */
#define PIO_PCMR_DSIZE_Msk                    (_UINT32_(0x3) << PIO_PCMR_DSIZE_Pos)                /* (PIO_PCMR) Parallel Capture Mode Data Size Mask */
#define PIO_PCMR_DSIZE(value)                 (PIO_PCMR_DSIZE_Msk & (_UINT32_(value) << PIO_PCMR_DSIZE_Pos)) /* Assignment of value for DSIZE in the PIO_PCMR register */
#define   PIO_PCMR_DSIZE_BYTE_Val             _UINT32_(0x0)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit)  */
#define   PIO_PCMR_DSIZE_HALFWORD_Val         _UINT32_(0x1)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit)  */
#define   PIO_PCMR_DSIZE_WORD_Val             _UINT32_(0x2)                                        /* (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit)  */
#define PIO_PCMR_DSIZE_BYTE                   (PIO_PCMR_DSIZE_BYTE_Val << PIO_PCMR_DSIZE_Pos)      /* (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit) Position */
#define PIO_PCMR_DSIZE_HALFWORD               (PIO_PCMR_DSIZE_HALFWORD_Val << PIO_PCMR_DSIZE_Pos)  /* (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit) Position */
#define PIO_PCMR_DSIZE_WORD                   (PIO_PCMR_DSIZE_WORD_Val << PIO_PCMR_DSIZE_Pos)      /* (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit) Position */
#define PIO_PCMR_ALWYS_Pos                    _UINT32_(9)                                          /* (PIO_PCMR) Parallel Capture Mode Always Sampling Position */
#define PIO_PCMR_ALWYS_Msk                    (_UINT32_(0x1) << PIO_PCMR_ALWYS_Pos)                /* (PIO_PCMR) Parallel Capture Mode Always Sampling Mask */
#define PIO_PCMR_ALWYS(value)                 (PIO_PCMR_ALWYS_Msk & (_UINT32_(value) << PIO_PCMR_ALWYS_Pos)) /* Assignment of value for ALWYS in the PIO_PCMR register */
#define PIO_PCMR_HALFS_Pos                    _UINT32_(10)                                         /* (PIO_PCMR) Parallel Capture Mode Half Sampling Position */
#define PIO_PCMR_HALFS_Msk                    (_UINT32_(0x1) << PIO_PCMR_HALFS_Pos)                /* (PIO_PCMR) Parallel Capture Mode Half Sampling Mask */
#define PIO_PCMR_HALFS(value)                 (PIO_PCMR_HALFS_Msk & (_UINT32_(value) << PIO_PCMR_HALFS_Pos)) /* Assignment of value for HALFS in the PIO_PCMR register */
#define PIO_PCMR_FRSTS_Pos                    _UINT32_(11)                                         /* (PIO_PCMR) Parallel Capture Mode First Sample Position */
#define PIO_PCMR_FRSTS_Msk                    (_UINT32_(0x1) << PIO_PCMR_FRSTS_Pos)                /* (PIO_PCMR) Parallel Capture Mode First Sample Mask */
#define PIO_PCMR_FRSTS(value)                 (PIO_PCMR_FRSTS_Msk & (_UINT32_(value) << PIO_PCMR_FRSTS_Pos)) /* Assignment of value for FRSTS in the PIO_PCMR register */
#define PIO_PCMR_Msk                          _UINT32_(0x00000E31)                                 /* (PIO_PCMR) Register Mask  */


/* -------- PIO_PCIER : (PIO Offset: 0x154) ( /W 32) Parallel Capture Interrupt Enable Register -------- */
#define PIO_PCIER_DRDY_Pos                    _UINT32_(0)                                          /* (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Position */
#define PIO_PCIER_DRDY_Msk                    (_UINT32_(0x1) << PIO_PCIER_DRDY_Pos)                /* (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Mask */
#define PIO_PCIER_DRDY(value)                 (PIO_PCIER_DRDY_Msk & (_UINT32_(value) << PIO_PCIER_DRDY_Pos)) /* Assignment of value for DRDY in the PIO_PCIER register */
#define PIO_PCIER_OVRE_Pos                    _UINT32_(1)                                          /* (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Position */
#define PIO_PCIER_OVRE_Msk                    (_UINT32_(0x1) << PIO_PCIER_OVRE_Pos)                /* (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Mask */
#define PIO_PCIER_OVRE(value)                 (PIO_PCIER_OVRE_Msk & (_UINT32_(value) << PIO_PCIER_OVRE_Pos)) /* Assignment of value for OVRE in the PIO_PCIER register */
#define PIO_PCIER_ENDRX_Pos                   _UINT32_(2)                                          /* (PIO_PCIER) End of Reception Transfer Interrupt Enable Position */
#define PIO_PCIER_ENDRX_Msk                   (_UINT32_(0x1) << PIO_PCIER_ENDRX_Pos)               /* (PIO_PCIER) End of Reception Transfer Interrupt Enable Mask */
#define PIO_PCIER_ENDRX(value)                (PIO_PCIER_ENDRX_Msk & (_UINT32_(value) << PIO_PCIER_ENDRX_Pos)) /* Assignment of value for ENDRX in the PIO_PCIER register */
#define PIO_PCIER_RXBUFF_Pos                  _UINT32_(3)                                          /* (PIO_PCIER) Reception Buffer Full Interrupt Enable Position */
#define PIO_PCIER_RXBUFF_Msk                  (_UINT32_(0x1) << PIO_PCIER_RXBUFF_Pos)              /* (PIO_PCIER) Reception Buffer Full Interrupt Enable Mask */
#define PIO_PCIER_RXBUFF(value)               (PIO_PCIER_RXBUFF_Msk & (_UINT32_(value) << PIO_PCIER_RXBUFF_Pos)) /* Assignment of value for RXBUFF in the PIO_PCIER register */
#define PIO_PCIER_Msk                         _UINT32_(0x0000000F)                                 /* (PIO_PCIER) Register Mask  */


